Heureka-L/STM32F10XXX/999复习/009定时器中断/System/Timer.c
#include "stm32f10x.h"
uint16_t timcount = 0;
void Timer_Init(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
    TIM_ETRClockMode2Config(TIM2,TIM_ExtTRGPSC_OFF,TIM_ExtTRGPolarity_Inverted,0x00);

    TIM_TimeBaseInitTypeDef TIMBase_InitStucture;
    TIMBase_InitStucture.TIM_ClockDivision = TIM_CKD_DIV1;
    TIMBase_InitStucture.TIM_CounterMode = TIM_CounterMode_Up;
    TIMBase_InitStucture.TIM_Period = 10-1;
    TIMBase_InitStucture.TIM_Prescaler = 1-1;
    TIMBase_InitStucture.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM2,&TIMBase_InitStucture);

    TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
    
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStructure);

    TIM_Cmd(TIM2,ENABLE);
}

uint16_t Timer_counter(void){

    return timcount;

};

void TIM2_IRQHandler(void){
    if(TIM_GetITStatus(TIM2,TIM_IT_Update) == SET){
        timcount ++;
        TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
    }
}
